
Процедура ОбработкаПроведения(Отказ, Режим)

	СтоимостьУчастия = Мероприятие.СтоимостьУчастия;
	Если НЕ ЗначениеЗаполнено(СтоимостьУчастия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Внимание! Не заполнена стоимость участия у мероприятия '%1'", Мероприятие));
	КонецЕсли;
	
	// регистр ЗадолженностьУчастников Приход
	Движения.ЗадолженностьУчастников.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Участники Цикл
		Движение = Движения.ЗадолженностьУчастников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Мероприятие = Мероприятие;
		Движение.Участник = СтрокаТЧ.Участник;
		Движение.Сумма = СтоимостьУчастия;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Мероприятие");
	ПроверяемыеРеквизиты.Добавить("Участники.Участник");
	
КонецПроцедуры
